Идея мини проекта по проектированию метода!

First Method (Your first method).

Цель: показать как проектировать и создавать методы.

1. Задача:
Напишите программу, которая принимает оценку студента
от 0 до 100 и выводит соответствующую буквенную оценку
(A для 90-100, B для 80-89, C для 70-79, D для 60-69 и F для 0-59).

2. Решаем задачу в лоб main() метод.

3. Хороший вопрос: а что если нам надо применить
этот расчет для большого количества студентов?

4. Аналогия инструмента в строительстве.
Забиваем один гвоздь камнем (чем попало и как попало).
Надо забить много гвоздей.
Что делать?
Создаем инструмент - молоток для облегчения работы.

5. Начинаем работу над созданием нашего инструмента.
Мы используем язык программирования.
Это накладывает свои ограничения.
Создаем коробочку где наш
инструмент будет находиться - класс.
Придумываем название класса.
GradeCalculator

6. Мы хотим реализовать алгоритм.
Алгоритм это действие! Действие это глагол.
Придумываем название нашему методу!

calculateGrade()


7. Взгляд на наш алгоритм с высоты птичьего полета.
Определяем входные параметры (название, смысл, тип данных).

8. Взгляд на наш алгоритм с высоты птичьего полета.
Определяем результат (смысл, тип данных).

9. Объединяем все вместе: сигнатура метода.
String calculateGrade(int mark)

10. Тело метода.
String calculateGrade(int mark) {
	// method body
}

11. Реализуем наш алгоритм внутри тела метода.
Команда return.

12. Взгляд со стороны. Наш алгоритм не использует
вывод на консоль. Наш алгоритм это чисто расчет.
Как показывать результаты пользователю будет
GradeCalculatorApplication

13. Создаем GradeCalculatorApplication + main()

14. Создаем объект GradeCalculator
Пару слов о дефолтном конструкторе.

15. Начинаем пользоваться нашим инструментом
делаем первый вызов метода в приложении!

16. Повторное многократное использование метода!

17. Вывод на консоль результатов в приложении.
System.out.println()

18. Чему мы научились?
